ithinuel/rp2040-pac/svd/rp2040-pass-1.svd
        <register>
          <name>IC_TX_ABRT_SOURCE</name>
          <description>I2C Transmit Abort Source Register\n\n
            This register has 32 bits that indicate the source of the TX_ABRT bit. Except for Bit 9, this register is cleared whenever the IC_CLR_TX_ABRT register or the IC_CLR_INTR register is read. To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first; RESTART must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]).\n\n
            Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, Bit 9 clears for one cycle and is then re-asserted.</description>
          <addressOffset>0x80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TX_FLUSH_CNT</name>
              <description>This field indicates the number of Tx FIFO Data Commands which are flushed due to TX_ABRT interrupt. It is cleared whenever I2C is disabled.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter</description>
              <bitRange>[31:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRT_USER_ABRT</name>
              <description>This is a master-mode-only bit. Master has detected the transfer abort (IC_ENABLE[1])\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_USER_ABRT_VOID</name>
                  <description>Transfer abort detected by master- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_USER_ABRT_GENERATED</name>
                  <description>Transfer abort detected by master</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_SLVRD_INTX</name>
              <description>1: When the processor side responds to a slave mode request for data to be transmitted to a remote master and user writes a 1 in CMD (bit 8) of IC_DATA_CMD register.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Slave-Transmitter</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_SLVRD_INTX_VOID</name>
                  <description>Slave trying to transmit to remote master in read mode- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_SLVRD_INTX_GENERATED</name>
                  <description>Slave trying to transmit to remote master in read mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_SLV_ARBLOST</name>
              <description>This field indicates that a Slave has lost the bus while transmitting data to a remote master. IC_TX_ABRT_SOURCE[12] is set at the same time. Note:  Even though the slave never 'owns' the bus, something could go wrong on the bus. This is a fail safe check. For instance, during a data transmission at the low-to-high transition of SCL, if what is on the data bus is not what is supposed to be transmitted, then DW_apb_i2c no longer own the bus.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Slave-Transmitter</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_SLV_ARBLOST_VOID</name>
                  <description>Slave lost arbitration to remote master- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_SLV_ARBLOST_GENERATED</name>
                  <description>Slave lost arbitration to remote master</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_SLVFLUSH_TXFIFO</name>
              <description>This field specifies that the Slave has received a read command and some data exists in the TX FIFO, so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Slave-Transmitter</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_SLVFLUSH_TXFIFO_VOID</name>
                  <description>Slave flushes existing data in TX-FIFO upon getting read command- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_SLVFLUSH_TXFIFO_GENERATED</name>
                  <description>Slave flushes existing data in TX-FIFO upon getting read command</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARB_LOST</name>
              <description>This field specifies that the Master has lost arbitration, or if IC_TX_ABRT_SOURCE[14] is also set, then the slave transmitter has lost arbitration.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_LOST_VOID</name>
                  <description>Master or Slave-Transmitter lost arbitration- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_LOST_GENERATED</name>
                  <description>Master or Slave-Transmitter lost arbitration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_MASTER_DIS</name>
              <description>This field indicates that the User tries to initiate a Master operation with the Master mode disabled.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_MASTER_DIS_VOID</name>
                  <description>User initiating master operation when MASTER disabled- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_MASTER_DIS_GENERATED</name>
                  <description>User initiating master operation when MASTER disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_10B_RD_NORSTRT</name>
              <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the master sends a read command in 10-bit addressing mode.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Receiver</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_10B_RD_VOID</name>
                  <description>Master not trying to read in 10Bit addressing mode when RESTART disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_10B_RD_GENERATED</name>
                  <description>Master trying to read in 10Bit addressing mode when RESTART disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_SBYTE_NORSTRT</name>
              <description>To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed first; restart must be enabled (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must be cleared (IC_TAR[10]). Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in the same manner as other bits in this register. If the source of the ABRT_SBYTE_NORSTRT is not fixed before attempting to clear this bit, bit 9 clears for one cycle and then gets reasserted. When this field is set to 1, the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to send a START Byte.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_SBYTE_NORSTRT_VOID</name>
                  <description>User trying to send START byte when RESTART disabled- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_SBYTE_NORSTRT_GENERATED</name>
                  <description>User trying to send START byte when RESTART disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_HS_NORSTRT</name>
              <description>This field indicates that the restart is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to use the master to transfer data in High Speed mode.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_HS_NORSTRT_VOID</name>
                  <description>User trying to switch Master to HS mode when RESTART disabled- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_HS_NORSTRT_GENERATED</name>
                  <description>User trying to switch Master to HS mode when RESTART disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_SBYTE_ACKDET</name>
              <description>This field indicates that the Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_SBYTE_ACKDET_VOID</name>
                  <description>ACK detected for START byte- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_SBYTE_ACKDET_GENERATED</name>
                  <description>ACK detected for START byte</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_HS_ACKDET</name>
              <description>This field indicates that the Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_HS_ACK_VOID</name>
                  <description>HS Master code ACKed in HS Mode- scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_HS_ACK_GENERATED</name>
                  <description>HS Master code ACKed in HS Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_GCALL_READ</name>
              <description>This field indicates that DW_apb_i2c in the master mode has sent a General Call but the user programmed the byte following the General Call to be a read from the bus (IC_DATA_CMD[9] is set to 1).\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_GCALL_READ_VOID</name>
                  <description>GCALL is followed by read from bus-scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_GCALL_READ_GENERATED</name>
                  <description>GCALL is followed by read from bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_GCALL_NOACK</name>
              <description>This field indicates that DW_apb_i2c in master mode has sent a General Call and no slave on the bus acknowledged the General Call.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_GCALL_NOACK_VOID</name>
                  <description>GCALL not ACKed by any slave-scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_GCALL_NOACK_GENERATED</name>
                  <description>GCALL not ACKed by any slave</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_TXDATA_NOACK</name>
              <description>This field indicates the master-mode only bit. When the master receives an acknowledgement for the address, but when it sends data byte(s) following the address, it did not receive an acknowledge from the remote slave(s).\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABRT_TXDATA_NOACK_VOID</name>
                  <description>Transmitted data non-ACKed by addressed slave-scenario not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABRT_TXDATA_NOACK_GENERATED</name>
                  <description>Transmitted data not ACKed by addressed slave</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_10ADDR2_NOACK</name>
              <description>This field indicates that the Master is in 10-bit address mode and that the second address byte of the 10-bit address was not acknowledged by any slave.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>This abort is not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Byte 2 of 10Bit Address not ACKed by any slave</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_10ADDR1_NOACK</name>
              <description>This field indicates that the Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>This abort is not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Byte 1 of 10Bit Address not ACKed by any slave</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABRT_7B_ADDR_NOACK</name>
              <description>This field indicates that the Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.\n\n
                Reset value: 0x0\n\n
                Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>This abort is not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>This abort is generated because of NOACK for 7-bit address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IC_SLV_DATA_NACK_ONLY</name>
          <description>Generate Slave Data NACK Register\n\n
            The register is used to generate a NACK for the data part of a transfer when DW_apb_i2c is acting as a slave-receiver. This register only exists when the IC_SLV_DATA_NACK_ONLY parameter is set to 1. When this parameter disabled, this register does not exist and writing to the register's address has no effect.\n\n
            A write can occur on this register if both of the following conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0] = 0) - Slave part is inactive (IC_STATUS[6] = 0) Note: The IC_STATUS[6] is a register read-back location for the internal slv_activity signal; the user should poll this before writing the ic_slv_data_nack_only bit.</description>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NACK</name>
              <description>Generate NACK. This NACK generation only occurs when DW_apb_i2c is a slave-receiver. If this register is set to a value of 1, it can only generate a NACK after a data byte is received; hence, the data transfer is aborted and the data received is not pushed to the receive buffer.\n\n
                When the register is set to a value of 0, it generates NACK/ACK, depending on normal criteria. - 1: generate NACK after data byte received - 0: generate NACK/ACK normally Reset value: 0x0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Slave receiver generates NACK normally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Slave receiver generates NACK upon data reception only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
