ithinuel/rp2040-pac/svd/rp2040-pass-1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER</name>
      <version>1</version>
      <description>Controls time and alarms\n
        time is a 64 bit value indicating the time in usec since power-on\n
        timeh is the top 32 bits of time &amp; timel is the bottom 32 bits\n
        to change time write to timelw before timehw\n
        to read time read from timelr before timehr\n
        An alarm is set by setting alarm_enable and writing to the corresponding alarm register\n
        When an alarm is pending, the corresponding alarm_running signal will be high\n
        An alarm can be cancelled before it has finished by clearing the alarm_enable\n
        When an alarm fires, the corresponding alarm_irq is set and alarm_running is cleared\n
        To clear the interrupt write a 1 to the corresponding alarm_irq</description>
      <baseAddress>0x40054000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIMER_IRQ_0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>TIMER_IRQ_1</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>TIMER_IRQ_2</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>TIMER_IRQ_3</name>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>TIMEHW</name>
          <description>Write to bits 63:32 of time\n
            always write timelw before timehw</description>
          <addressOffset>0x0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>TIMELW</name>
          <description>Write to bits 31:0 of time\n
            writes do not get copied to time until timehw is written</description>
          <addressOffset>0x4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>TIMEHR</name>
          <description>Read from bits 63:32 of time\n
            always read timelr before timehr</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>TIMELR</name>
          <description>Read from bits 31:0 of time</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ALARM0</name>
          <description>Arm alarm 0, and configure the time it will fire.\n
            Once armed, the alarm fires when TIMER_ALARM0 == TIMELR.\n
            The alarm will disarm itself once it fires, and can\n
            be disarmed early using the ARMED status register.</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ALARM1</name>
          <description>Arm alarm 1, and configure the time it will fire.\n
            Once armed, the alarm fires when TIMER_ALARM1 == TIMELR.\n
            The alarm will disarm itself once it fires, and can\n
            be disarmed early using the ARMED status register.</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ALARM2</name>
          <description>Arm alarm 2, and configure the time it will fire.\n
            Once armed, the alarm fires when TIMER_ALARM2 == TIMELR.\n
            The alarm will disarm itself once it fires, and can\n
            be disarmed early using the ARMED status register.</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ALARM3</name>
          <description>Arm alarm 3, and configure the time it will fire.\n
            Once armed, the alarm fires when TIMER_ALARM3 == TIMELR.\n
            The alarm will disarm itself once it fires, and can\n
            be disarmed early using the ARMED status register.</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ARMED</name>
          <description>Indicates the armed/disarmed status of each alarm.\n
            A write to the corresponding ALARMx register arms the alarm.\n
            Alarms automatically disarm upon firing, but writing ones here\n
            will disarm immediately without waiting to fire.</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ARMED</name>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERAWH</name>
          <description>Raw read from bits 63:32 of time (no side effects)</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>TIMERAWL</name>
          <description>Raw read from bits 31:0 of time (no side effects)</description>
          <addressOffset>0x28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>DBGPAUSE</name>
          <description>Set bits high to enable pause when the corresponding debug ports are active</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>DBG1</name>
              <description>Pause when processor 1 is in debug mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG0</name>
              <description>Pause when processor 0 is in debug mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSE</name>
          <description>Set high to pause the timer</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PAUSE</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ALARM_2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ALARM_1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ALARM_0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x38</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <description>Interrupt Force</description>
          <addressOffset>0x3C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS</name>
          <description>Interrupt status after masking &amp; forcing</description>
          <addressOffset>0x40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
