ithinuel/rp2040-pac/svd/rp2040-pass-1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBCTRL_REGS</name>
      <version>1</version>
      <description>USB FS/LS controller device registers</description>
      <baseAddress>0x50110000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBCTRL_IRQ</name>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>ADDR_ENDP</name>
          <description>Device address and endpoint control</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENDPOINT</name>
              <description>Device endpoint to send data to. Only valid for HOST mode.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>In device mode, the address that the device should respond to. Set in response to a SET_ADDR setup packet from the host. In host mode set to the address of the device to communicate with.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP1</name>
          <description>Interrupt endpoint 1. Only valid for HOST mode.</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP2</name>
          <description>Interrupt endpoint 2. Only valid for HOST mode.</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP3</name>
          <description>Interrupt endpoint 3. Only valid for HOST mode.</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP4</name>
          <description>Interrupt endpoint 4. Only valid for HOST mode.</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP5</name>
          <description>Interrupt endpoint 5. Only valid for HOST mode.</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP6</name>
          <description>Interrupt endpoint 6. Only valid for HOST mode.</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP7</name>
          <description>Interrupt endpoint 7. Only valid for HOST mode.</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP8</name>
          <description>Interrupt endpoint 8. Only valid for HOST mode.</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP9</name>
          <description>Interrupt endpoint 9. Only valid for HOST mode.</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP10</name>
          <description>Interrupt endpoint 10. Only valid for HOST mode.</description>
          <addressOffset>0x28</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP11</name>
          <description>Interrupt endpoint 11. Only valid for HOST mode.</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP12</name>
          <description>Interrupt endpoint 12. Only valid for HOST mode.</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP13</name>
          <description>Interrupt endpoint 13. Only valid for HOST mode.</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP14</name>
          <description>Interrupt endpoint 14. Only valid for HOST mode.</description>
          <addressOffset>0x38</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP15</name>
          <description>Interrupt endpoint 15. Only valid for HOST mode.</description>
          <addressOffset>0x3C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_CTRL</name>
          <description>Main control register</description>
          <addressOffset>0x40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIM_TIMING</name>
              <description>Reduced timings for simulation</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_NDEVICE</name>
              <description>Device mode = 0, Host mode = 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CONTROLLER_EN</name>
              <description>Enable controller</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOF_WR</name>
          <description>Set the SOF (Start of Frame) frame number in the host controller. The SOF packet is sent every 1ms and the host will increment the frame number by 1 each time.</description>
          <addressOffset>0x44</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <bitRange>[10:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOF_RD</name>
          <description>Read the last SOF (Start of Frame) frame number seen. In device mode the last SOF received from the host. In host mode the last SOF sent by the host.</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
