ithinuel/rp2040-pac/svd/rp2040-pass-1.svd
          <register>
            <name>SM_ADDR</name>
            <description>Current instruction address of state machine 0</description>
            <addressOffset>0xC</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SM0_ADDR</name>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SM_INSTR</name>
            <description>Read to see the instruction currently addressed by state machine 0's program counter\n
            Write to execute an instruction immediately (including jumps) and then resume execution.</description>
            <addressOffset>0x10</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SM0_INSTR</name>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SM_PINCTRL</name>
            <description>State machine pin control</description>
            <addressOffset>0x14</addressOffset>
            <resetValue>0x14000000</resetValue>
            <fields>
              <field>
                <name>SIDESET_COUNT</name>
                <description>The number of MSBs of the Delay/Side-set instruction field which are used for side-set. Inclusive of the enable bit, if present. Minimum of 0 (all delay bits, no side-set) and maximum of 5 (all side-set, no delay).</description>
                <bitRange>[31:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SET_COUNT</name>
                <description>The number of pins asserted by a SET. In the range 0 to 5 inclusive.</description>
                <bitRange>[28:26]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_COUNT</name>
                <description>The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV PINS instruction. In the range 0 to 32 inclusive.</description>
                <bitRange>[25:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_BASE</name>
                <description>The pin which is mapped to the least-significant bit of a state machine's IN data bus. Higher-numbered pins are mapped to consecutively more-significant data bits, with a modulo of 32 applied to pin number.</description>
                <bitRange>[19:15]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SIDESET_BASE</name>
                <description>The lowest-numbered pin that will be affected by a side-set operation. The MSBs of an instruction's side-set/delay field (up to 5, determined by SIDESET_COUNT) are used for side-set data, with the remaining LSBs used for delay. The least-significant bit of the side-set portion is the bit written to this pin, with more-significant bits written to higher-numbered pins.</description>
                <bitRange>[14:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SET_BASE</name>
                <description>The lowest-numbered pin that will be affected by a SET PINS or SET PINDIRS instruction. The data written to this pin is the least-significant bit of the SET data.</description>
                <bitRange>[9:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_BASE</name>
                <description>The lowest-numbered pin that will be affected by an OUT PINS, OUT PINDIRS or MOV PINS instruction. The data written to this pin will always be the least-significant bit of the OUT or MOV data.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0x128</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SM3</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM2</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM1</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM0</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM3_TXNFULL</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM2_TXNFULL</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM1_TXNFULL</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM0_TXNFULL</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM3_RXNEMPTY</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM2_RXNEMPTY</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM1_RXNEMPTY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM0_RXNEMPTY</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0xC</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>SM_IRQ%s</name>
          <description>Cluster SM_IRQ%s, containing IRQ*_INTE, IRQ*_INTF, IRQ*_INTS</description>
          <addressOffset>0x12C</addressOffset>
          <register>
            <name>IRQ_INTE</name>
            <description>Interrupt Enable for irq0</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SM3</name>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM2</name>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM1</name>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM0</name>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM3_TXNFULL</name>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM2_TXNFULL</name>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM1_TXNFULL</name>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM0_TXNFULL</name>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM3_RXNEMPTY</name>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM2_RXNEMPTY</name>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM1_RXNEMPTY</name>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM0_RXNEMPTY</name>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IRQ_INTF</name>
            <description>Interrupt Force for irq0</description>
            <addressOffset>0x4</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SM3</name>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM2</name>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM1</name>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM0</name>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM3_TXNFULL</name>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM2_TXNFULL</name>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM1_TXNFULL</name>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM0_TXNFULL</name>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM3_RXNEMPTY</name>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM2_RXNEMPTY</name>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM1_RXNEMPTY</name>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SM0_RXNEMPTY</name>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IRQ_INTS</name>
            <description>Interrupt status after masking &amp; forcing for irq0</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SM3</name>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM2</name>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM1</name>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM0</name>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM3_TXNFULL</name>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM2_TXNFULL</name>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM1_TXNFULL</name>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM0_TXNFULL</name>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM3_RXNEMPTY</name>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM2_RXNEMPTY</name>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM1_RXNEMPTY</name>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SM0_RXNEMPTY</name>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
